use utf8;
use strict;
my @chr = map { sprintf('%x', ord $_) } split //, '⼀⼁⼂⼃⼄⼅⼆⼇⼈⼉⼊⼋⼌⼍⼎⼏⼐⼑⼒⼓⼔⼕⼖⼗⼘⼙⼚⼛⼜⼝⼞⼟⼠⼡⼢⼣⼤⼥⼦⼧⼨⼩⼪⼫⼬⼭⼮⼯⼰⼱⼲⼳⼴⼵⼶⼷⼸⼹⼺⼻⼼⼽⼾⼿⽀⽁⽂⽃⽄⽅⽆⽇⽈⽉⽊⽋⽌⽍⽎⽏⽐⽑⽒⽓⽔⽕⽖⽗⽘⽙⺦⽚⽛⽜⽝⽞⽟⽠⽡⽢⽣⽤⽥⽦⽧⽨⽩⽪⽫⽬⽭⽮⽯⽰⽱⽲⽳⽴⽵⽶⽷⺰⽸⽹⽺⽻⽼⽽⽾⽿⾀⾁⾂⾃⾄⾅⾆⾇⾈⾉⾊⾋⾌⾍⾎⾏⾐⾑⾒⻅⾓⾔⻈⾕⾖⾗⾘⾙⻉⾚⾛⾜⾝⾞⻋⾟⾠⾡⻌⾢⾣⾤⾥⾦⻐⾧⻓⾨⻔⾩⾪⾫⾬⾭⾮⾯⾰⾱⻙⾲⾳⾴⻚⾵⻛⾶⻜⾷⻠⾸⾹⾺⻢⾻⾼⾽⾾⾿⿀⿁⿂⻥⻦⿃⿄⻧⿅⿆⻨⿇⿈⻩⿉⿊⿋⿌⻪⿍⿎⿏⿐⿑⻬⿒⻮⿓⻰⿔⻳⿕';
my @rad = map { sprintf('%x', ord $_) } split //, '一丨丶丿乙亅二亠人儿入八冂冖冫几凵刀力勹匕匚匸十卜卩厂厶又口囗土士夂夊夕大女子宀寸小尢尸屮山巛工己巾干幺广廴廾弋弓彐彡彳心戈戶手支攴文斗斤方无日曰月木欠止歹殳毋比毛氏气水火爪父爻爿丬片牙牛犬玄玉瓜瓦甘生用田疋疒癶白皮皿目矛矢石示禸禾穴立竹米糸纟缶网羊羽老而耒耳聿肉臣自至臼舌舛舟艮色艸虍虫血行衣襾見见角言讠谷豆豕豸貝贝赤走足身車车辛辰辵辶邑酉釆里金钅長长門门阜隶隹雨靑非面革韋韦韭音頁页風风飛飞食饣首香馬马骨高髟鬥鬯鬲鬼魚鱼鸟鳥鹵卤鹿麥麦麻黃黄黍黑黹黽黾鼎鼓鼠鼻齊齐齒齿龍龙龜龟龠';
my %r2c;
while (my $c = shift(@chr)) {
    my $r = shift(@rad);
    $r2c{$c} = $r;
}

my %seen;
local $/ = ' />';
while (<>) {
    my $orig = $_;
    s!&#x\K([^;]+)!
        $seen{$1}++;
        $r2c{$1} ? (
            $seen{$r2c{$1}} ? $1 : $r2c{$1}
        ) : $1
    !eg;
    print $orig if $orig ne $_;
    print;
}
